Table of Contents
 Class MatAnchorProperties
Namespace
IdeaRS.OpenModel.Material
Assembly
IdeaRS.OpenModel.dll
Anchor custom data
public class MatAnchorProperties
Inheritance
object
MatAnchorProperties
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 FLS
Limit force in shear.
public double FLS { get; set; }
Property Value
double
 FLT
Limit force in tension
public double FLT { get; set; }
Property Value
double
 KS
Shear linear stiffness.
public double KS { get; set; }
Property Value
double
 KSN
Nonlinear stiffness in shear after over loaded FLS
public double KSN { get; set; }
Property Value
double
 KT
Tension linear stiffness.
public double KT { get; set; }
Property Value
double
 KTN
Nonlinear stiffness in tension after over loaded FLT
public double KTN { get; set; }
Property Value
double
 Uls
Limit deformation in shear for stop solution UCRIT
public double Uls { get; set; }
Property Value
double
 Ult
Limit deformation in tension for stop solution UCRIT
public double Ult { get; set; }
Property Value
double
 Edit this page